---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterLength
source: html/c351919f-b5b4-51b3-7861-51ba6b32523e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterLength Property

"Baluster Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalusterLength { get; }
```